package sem_1;
/*
 * Имеются натуральные числа A и B, где A < B
 * Робот (исполнтель) имеет две кнопки К1 и К2. Кнопки К1 увеличивает значение А в С раз, К2 прибавляет D к Аб
 * C, D - натуральные числа. 
 * Вопрос: сколько существует способов А "превратить" в В с помощью К1 и К2 ?
 * 
 * Например: А=2, В=9, С=2 и D=1 последовательность  нажатий кнопок
 *          1. А=2 + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) -> В=9
 *          2. А=2 * 2(нажали К1) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) -> В=9
 *          3. А=2 + 1(нажали К2) * 2(нажали К1) + 1(нажали К2) + 1(нажали К2) + 1(нажали К2) -> В=9
 *          4. А=2 + 1(нажали К2) + 1(нажали К2) * 2(нажали К1) + 1(нажали К2) -> В=9          
 *          5. А=2 * 2 (нажали К1)* 2(нажали К1) + 1(нажали К2) -> В=9
 * 
 */

public class zad_dop {

    public static void main(String[] args) {
        


    }
    
}
